#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.infrastructure.module.kubernetes_config.helm_release.spark will be created
  + resource "helm_release" "spark" {
      + atomic                = false
      + chart                 = "spark"
      + cleanup_on_fail       = false
      + dependency_update     = false
      + disable_crd_hooks     = false
      + disable_webhooks      = false
      + force_update          = false
      + id                    = (known after apply)
      + max_history           = 0
      + metadata              = (known after apply)
      + name                  = "spark"
      + namespace             = "content"
      + recreate_pods         = false
      + render_subchart_notes = true
      + replace               = false
      + repository            = "https://charts.bitnami.com/bitnami"
      + reset_values          = false
      + reuse_values          = false
      + skip_crds             = false
      + status                = "deployed"
      + timeout               = 300
      + verify                = false
      + version               = "1.2.10"
      + wait                  = true
    }

  # module.infrastructure.module.kubernetes_config.kubernetes_namespace.content will be created
  + resource "kubernetes_namespace" "content" {
      + id = (known after apply)

      + metadata {
          + annotations      = {
              + "name" = "content"
            }
          + generation       = (known after apply)
          + name             = "content"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
